/*
 * arm64-delta-b30ge6x1-cpld.c - Read/Write b30ge6x1 CPLD registers
 *
 * Copyright (C) 2022 Delta network Technology Corporation.
 * Cary Chen <cary.sc.chen@deltaww.com>
 *
 *
 * Based on:
 *    pca954x.c from Kumar Gala <galak@kernel.crashing.org>
 * Copyright (C) 2006
 *
 * Based on:
 *    pca954x.c from Ken Harrenstien
 * Copyright (C) 2004 Google, Inc. (Ken Harrenstien)
 *
 * Based on:
 *    i2c-virtual_cb.c from Brian Kuschak <bkuschak@yahoo.com>
 * and
 *    pca9540.c from Jean Delvare <khali@linux-fr.org>.
 *
 * This file is licensed under the terms of the GNU General Public
 * License version 2. This program is licensed "as is" without any
 * warranty of any kind, whether express or implied.
 */

#include <linux/kernel.h>
#include <linux/gpio/driver.h>
#include <linux/init.h>
#include <linux/platform_device.h>
#include <linux/of.h>
#include <linux/of_device.h>
#include <linux/module.h>
#include <linux/init.h>
#include <linux/slab.h>
#include <linux/device.h>
#include <linux/jiffies.h>
#include <linux/i2c.h>
#include <linux/hwmon-sysfs.h>
#include <linux/delay.h>

/* CPLD Register Define */
#define B30GE6X1_CPLD_SLAVE_ADDR           0x31

#define B30GE6X1_CPLD_REG_HW_VER           0x00    /* RO */
#define B30GE6X1_CPLD_REG_PLATFORM_ID      0x01    /* RO */
#define B30GE6X1_CPLD_REG_CPLD_VER         0x02    /* RO */
#define B30GE6X1_CPLD_REG_PSU_STATUS       0x0A    /* RO */
#define B30GE6X1_CPLD_REG_SFP_TX_DIS       0x30    /* RW */
#define B30GE6X1_CPLD_REG_SFP_PSNT         0x31    /* RO */
#define B30GE6X1_CPLD_REG_SFP_RX_LOS       0x32    /* RO */
#define B30GE6X1_CPLD_REG_LED_STATUS       0x41    /* RW */

#define B30GE6X1_CPLD_BIT_PSU_EXT_PRESENT  4
#define B30GE6X1_CPLD_BIT_PSU_EXT_PG       3
#define B30GE6X1_CPLD_BIT_PSU_INT_PG       2

#define B30GE6X1_CPLD_OFFSET_LED_SYS       4
#define B30GE6X1_CPLD_OFFSET_LED_PWR       2
#define B30GE6X1_CPLD_OFFSET_LED_FAN       0

#define B30GE6X1_CPLD_MASK_LED_SYS         0xF
#define B30GE6X1_CPLD_MASK_LED_PWR         0x3
#define B30GE6X1_CPLD_MASK_LED_FAN         0x3

#define B30GE6X1_CPLD_LED_VAL_OFF          0x0
#define B30GE6X1_CPLD_LED_VAL_GREEN        0x2
#define B30GE6X1_CPLD_LED_VAL_AMBER        0x1     /* except SYS LED */
#define B30GE6X1_CPLD_LED_VAL_AMBER_SYS    0x4
#define B30GE6X1_CPLD_LED_VAL_GREEN_BLINK  0x8
#define B30GE6X1_CPLD_LED_VAL_AMBER_BLINK  0xA

#define I2C_RW_RETRY_COUNT                 10
#define I2C_RW_RETRY_INTERVAL              60      /* ms */

#define B30GE6X1_GPIO_I2C_NGPIOS           18

static LIST_HEAD(cpld_client_list);
static struct mutex     list_lock;

struct cpld_client_node {
    struct i2c_client *client;
    struct list_head   list;
};

enum cpld_type {
    b30ge6x1_cpld,
    unknown_cpld
};

enum b30ge6x1_platform_id_e {
    PID_B30GE6X1 = 0x0A,
    PID_UNKNOWN
};

struct b30ge6x1_cpld_data {
    char valid;
    struct device *hwmon_dev;
    struct mutex  update_lock;
    unsigned long last_updated;     /* in jiffies */

    enum cpld_type type;
    int sfp_group_num;
    u8 reg_offset;
    u8 reg_data;

    /* register values */
    u8 hw_ver;              /* 0x00 RO*/
    u8 platform_id;         /* 0x01 RO*/
    u8 cpld_ver;            /* 0x02 RO*/
    u8 psu_status;          /* 0x0A RO*/
    u8 sfp_tx_dis[1];       /* 0x30 RW */
    u8 sfp_present[1];      /* 0x31 RO */
    u8 sfp_rx_los[1];       /* 0x32 RO */
    u8 led_status;          /* 0x41 RW */
};

struct gpio_i2c_reg {
    struct list_head head;
    u32 gpio_num;
    u32 reg_addr;
    u32 reg_mask;
};

struct gpio_i2c_chip {
    struct gpio_chip gpio_chip;
    struct i2c_client *i2c;
    struct device *dev;

    struct list_head gpio_list;
};

static struct b30ge6x1_cpld_data *b30ge6x1_cpld_update_device(struct device *dev);

enum b30ge6x1_cpld_sysfs_attributes {
    PSU_EXT_PRESENT,
    PSU_EXT_PG,
    PSU_INT_PG,
    MODULE_PRESENT_ALL,
    MODULE_RX_LOS_ALL,
    MODULE_TX_DIS_ALL,
    MODULE_TX_DIS,
    MODULE_PRESENT,
    MODULE_RX_LOS,
    LED_SYS_STATUS,
    LED_PWR_STATUS,
    LED_FAN_STATUS,
};

enum led_light_mode {
    LED_MODE_OFF = 0,
    LED_MODE_GREEN,
    LED_MODE_AMBER,
    LED_MODE_GREEN_BLINKING,
    LED_MODE_AMBER_BLINKING,
    LED_MODE_UNKNOWN,
};

/*
 * CPLD read/write functions
 */
static int b30ge6x1_cpld_read_internal(struct i2c_client *client, u8 reg)
{
    int status = 0, retry = I2C_RW_RETRY_COUNT;

